OdTypeCode.reset
\details
Resets all parameters of the OdTypeCode object.
The method clears the parameters array.

OdTypeCode.appendParameter(OdRxValue!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Appends a new parameter for the OdTypeCode object.
\param any_var [in] An OdRxValue object that contains the value of the new parameter to be appended.

OdTypeCode.parameter(System.UInt32!System.Runtime.CompilerServices.IsLong)
\details
Retrieves the current value of a specified parameter of the OdTypeCode object.
The parameter which value is requested is specified with its index.
\param ind [in] A 32-bit unsigned integer value that contains the index of the requested parameter.
\returns An OdRxValue object that contains the current parameter value.
\remarks
If the index value is incorrect, the method returns an empty OdRxValue object.

OdTypeCode.paramCount
\details
Retrieves the number of the OdTypeCode object parameters.
\returns A 32-bit unsigned integer value that contains the number of the OdTypeCode object parameters.

OdTypeCode.#ctor
\details
Creates a new OdTypeCode object with a NULL value.

OdTypeCode.kTCAny
\details
A constant that represents the Any data type for the EXPRESS definition language.

OdTypeCode.kTCOctet
\details
A constant that represents the Octet data type for the EXPRESS definition language.

OdTypeCode.kTCUnion
\details
A constant that represents the Union data type for the EXPRESS definition language.

OdTypeCode.kTCSequence
\details
A constant that represents the Sequence data type for the EXPRESS definition language.

OdTypeCode.kTCObjectId
\details
A constant that represents the object identifier data type for the EXPRESS definition language.

OdTypeCode.kTCString
\details
A constant that represents the String class for the EXPRESS definition language.

OdTypeCode.kTCLogical
\details
A constant that represents the Logical data type for the EXPRESS definition language.

OdTypeCode.kTCBoolean
\details
A constant that represents the Boolean data type for the EXPRESS definition language.

OdTypeCode.kTCReal
\details
A constant that represents the Real data type for the EXPRESS definition language.

OdTypeCode.kTCInteger
\details
A constant that represents the integer data type for the EXPRESS definition language.

OdTypeCode.kTCNull
\details
A constant that represents the NULL value for any data type of the EXPRESS definition language.

OdTypeCode
\details
A class that stores principal information about EXPRESS types.
\sa
IFC Data Types